mpywalle/micropython/ports/stm32/main.c
    // run boot.py, if it exists
    // TODO perhaps have pyb.reboot([bootpy]) function to soft-reboot and execute custom boot.py
    if (reset_mode == 1 || reset_mode == 3) {
		int ret = exec_boot_script("boot.py", false);
		if(ret & PYEXEC_FORCED_EXIT)
			goto soft_reset_exit;
		if(!ret)
			flash_error(4);
    }

    // turn boot-up LEDs off
    #if !defined(MICROPY_HW_LED2)
    // If there is only one LED on the board then it's used to signal boot-up
    // and so we turn it off here.  Otherwise LED(1) is used to indicate dirty
    // flash cache and so we shouldn't change its state.
    led_state(1, 0);
    #endif
    led_state(2, 0);
    led_state(3, 0);
    led_state(4, 0);

    // Now we initialise sub-systems that need configuration from boot.py,
    // or whose initialisation can be safely deferred until after running
    // boot.py.

    #if MICROPY_HW_ENABLE_USB
    // init USB device to default setting if it was not already configured
    if (!(pyb_usb_flags & PYB_USB_FLAG_USB_MODE_CALLED)) {
        pyb_usb_dev_init(USBD_VID, USBD_PID_CDC_MSC, USBD_MODE_CDC_MSC, NULL);
    }
    #endif

    #if MICROPY_HW_HAS_MMA7660
    // MMA accel: init and reset
    accel_init();
    #endif

    #if MICROPY_HW_ENABLE_SERVO
    servo_init();
    #endif

    #if MICROPY_HW_ENABLE_DAC
    dac_init();
    #endif

    #if MICROPY_PY_NETWORK
    mod_network_init();
    #endif

    // At this point everything is fully configured and initialised.

    // Run the main script from the current directory.
    if ((reset_mode == 1 || reset_mode == 3) && pyexec_mode_kind == PYEXEC_MODE_FRIENDLY_REPL) {
		int ret = exec_boot_script("main.py", true);
		if(ret & PYEXEC_FORCED_EXIT)
			goto soft_reset_exit;
			;
		if(!ret)
			flash_error(3);
    }

    // Main script is finished, so now go into REPL mode.
    // The REPL mode can change, or it can request a soft reset.
    for (;;) {
		while (!usbdbg_script_ready()) {
			nlr_buf_t nlr;
			if (nlr_push(&nlr) == 0) {
				usbdbg_set_irq_enabled(true);

				if (pyexec_mode_kind == PYEXEC_MODE_RAW_REPL) {
					if (pyexec_raw_repl() != 0) {
						break;
					}
				} else {
					if (pyexec_friendly_repl() != 0) {
						break;
					}
				}
				nlr_pop();
			}
		}

        if (usbdbg_script_ready()) {
            nlr_buf_t nlr;
            if (nlr_push(&nlr) == 0) {
                // Enable IDE interrupt
                usbdbg_set_irq_enabled(true);

                // Execute the script.
                trace_write("execute py script in repl.\r\n");
                pyexec_str(usbdbg_get_script());
                nlr_pop();
            } else {
                mp_obj_print_exception(&mp_plat_print, (mp_obj_t)nlr.ret_val);
            }
        }
    }

soft_reset_exit:

    // soft reset

    #if MICROPY_HW_ENABLE_STORAGE
    printf("PYB: sync filesystems\n");
    storage_flush();
    #endif

    printf("PYB: soft reboot\n");
    #if MICROPY_PY_NETWORK
    mod_network_deinit();
    #endif
    timer_deinit();
    uart_deinit();
    #if MICROPY_HW_ENABLE_CAN
    can_deinit();
    #endif
    machine_deinit();

    #if MICROPY_PY_THREAD
    pyb_thread_deinit();
    #endif

    gc_sweep_all();

    goto soft_reset;
}
